# 作用于计分前
EFFECT_0x0031 = "红桃和方片视为同一花色, 黑桃和梅花视为同一花色"

# 作用于计分时
## 无条件

## 花色相关
EFFECT_0x0002 = "计分时, 方片+3倍率"
EFFECT_0x0003 = "计分时, 黑桃+3倍率"
EFFECT_0x0004 = "计分时, 红桃+3倍率"
EFFECT_0x0005 = "计分时, 梅花+3倍率"

EFFECT_0x002A = "计分的黑桃牌给予x1.5倍率"
EFFECT_0x0033 = "计分的红桃有1/2概率给予x1.5倍率"
EFFECT_0x0034 = "计分的黑桃给予+50筹码"
EFFECT_0x0035 = "计分的梅花给予+7倍率"

EFFECT_0x0046 = "红桃无效"
EFFECT_0x0047 = "黑桃无效"
EFFECT_0x0048 = "梅花无效"
EFFECT_0x0049 = "方块无效"

## 点数筹码
EFFECT_0x001B = "计分时, 人头牌+30筹码"
EFFECT_0x0010 = "计分的奇数牌+30筹码"


## 点数倍率
EFFECT_0x0019 = "计分时, A,2,3,5,8给予+8倍率"
EFFECT_0x001F = "计分的偶数牌+4倍率"
EFFECT_0x0024 = "第一张计分的人头卡给予x2倍率"
EFFECT_0x002D = "人头牌在计分时+5倍率"
EFFECT_0x0045 = "计分的K和Q给予x2倍率"
EFFECT_0x004A = "人头牌无效"

## 点数筹码和倍率
EFFECT_0x0011 = "计分的A给予+4倍率和+20筹码"
EFFECT_0x002B = "计分的10和4给予+10筹码和+4倍率"

## 重复触发
EFFECT_0x0017 = "计分时, 打出的牌触发2次"
EFFECT_0x001D = "重新触发打出的2,3,4,5"
EFFECT_0x002C = "重新触发所有打出的牌"
EFFECT_0x002F = "重新触发所有打出的人头牌"
EFFECT_0x0032 = "打出的第一张记分牌触发2次"

## 创建卡
EFFECT_0x0015 = "打出的每一张8在计分时有1/4概率生成一张技能卡"
EFFECT_0x0023 = "所有计分的人头卡变成黄金卡"

# 作用于计分后
## 无条件
EFFECT_0x0001 = "计分时, +4倍率"
EFFECT_0x0014 = "+100筹码"
EFFECT_0x0029 = "1/5的概率, +20倍率"
EFFECT_0x003D = "+250筹码"
EFFECT_0x001E = "1/6的概率, +15倍率"
## 牌型筹码
EFFECT_0x000A = "如果是对子牌型, +50筹码"
EFFECT_0x000B = "如果是三条牌型, +100筹码"
EFFECT_0x000C = "如果是两对牌型, +80筹码"
EFFECT_0x000D = "如果是顺子牌型, +100筹码"
EFFECT_0x000E = "如果是同花牌型, +80筹码"

## 牌型倍率
EFFECT_0x0006 = "如果是对子牌型, +8倍率"
EFFECT_0x0007 = "如果是三条牌型, +12倍率"
EFFECT_0x0008 = "如果是两对牌型, +10倍率"
EFFECT_0x0009 = "如果是同花牌型, +10倍率"
EFFECT_0x000F = "如果出牌少于3张, +20倍率"
EFFECT_0x0013 = "如果所有未计分牌均是黑桃或梅花, x3倍率"
EFFECT_0x0019 = "如果有3张计分的人头牌, +10倍率"
EFFECT_0x0037 = "如果记分牌中含有4种花色, x3倍率"
EFFECT_0x0038 = "如果牌型为两对, x2倍率"
EFFECT_0x0039 = "如果牌型为三条, x3倍率"
EFFECT_0x003A = "如果牌型为四条, x4倍率"
EFFECT_0x003B = "如果牌型为顺子, x3倍率"
EFFECT_0x003C = "如果牌型为同花, x2倍率"
EFFECT_0x004B = "同花无效"

## 牌型升级
EFFECT_0x0012 = "1/4概率升级打出的牌型"
EFFECT_0x0018 = "给予牌型等级总和x0.1的倍率"
EFFECT_0x0041 = "所有牌型等级提升1级"
EFFECT_0x0042 = "升级打出的牌型"

## 牌库筹码
EFFECT_0x0016 = "抽牌堆内剩余的每张牌, +2筹码"
EFFECT_0x0027 = "牌组内的每一张石头牌, +25筹码"

## 牌库倍率
EFFECT_0x001A = "牌组中的每张钢铁牌+0.2倍率"
EFFECT_0x001D = "牌库内的每一张增强卡, 给予x0.1倍率"
EFFECT_0x001F = "超过52张的每张卡, 给予x0.25倍率"
EFFECT_0x0026 = "比52张少的每张卡, 给予+4倍率"
EFFECT_0x0036 = "牌库中的每一张玻璃牌给予x0.75倍率"
EFFECT_0x003F = "如果牌组中含有16张以上的增加牌, x3倍率"
EFFECT_0x0044 = "少于12的每张人头牌, 给予x1倍率"

## 未计分
EFFECT_0x0021 = "未计分的每张K给与x1.5倍率"

## 其他信息倍率
EFFECT_0x0010 = "根据最后一张被使用的牌增加倍率"
EFFECT_0x0011 = "如果没有手牌, +15倍率"
EFFECT_0x0018 = "计分时, 倍率增加未计分的最小牌点数的2倍"
EFFECT_0x001C = "计分时, 每一个效果+3倍率"

## 其他信息筹码
EFFECT_0x0028 = "每拥有1w资金, +20筹码"

## 概率倍率
EFFECT_0x0013 = "1/6的概率, x4倍率"
EFFECT_0x0016 = "会是什么效果呢?[印错小丑]"

EFFECT_0x0043 = "每拥有1w资金, +2倍率"

## 抽卡
EFFECT_0x0025 = "抽5张技能卡, 计分时弃光所有卡"

## 印卡
EFFECT_0x0012 = "向牌组中添加一张石头牌"
EFFECT_0x0015 = "如果出牌仅有1张牌, 复制这张卡加入牌组"
EFFECT_0x001A = "如果出牌包含A和顺子, 生成一张技能卡"
EFFECT_0x001B = "如果牌型为同花顺, 生成一张技能卡"
EFFECT_0x0020 = "计分时, 若资金少于5w, 生成一张技能卡"
EFFECT_0x0022 = "牌组内的每一张9生成一张技能卡"
EFFECT_0x0040 = "生成一张技能卡"

## 删卡
EFFECT_0x0017 = "销毁每一张计分的6, 生成相应数量的技能卡"

## 资金
EFFECT_0x002E = "牌组中的每一张黄金牌给与1w资金"


# 牌组相关

# 未计分
EFFECT_0x003E = "每一张未计分的Q, 给予+13倍率"


# 技能卡
SKILL_0x0000 = "生成本局内最后被使用的卡, 这张除外"
SKILL_0x0001 = "增强2张手牌为幸运卡[1/5概率+20倍率]"
SKILL_0x0002 = "随机提升2个牌型各1级"
SKILL_0x0003 = "增强2张手牌为+4倍率卡"
SKILL_0x0004 = "生成2张技能卡"
SKILL_0x0005 = "增强2张手牌为+30筹码卡"
SKILL_0x0006 = "增强1张手牌为万能卡[视为任何花色]"
SKILL_0x0007 = "增强1张手牌为钢铁卡[未计分时给予x1.5倍率]"
SKILL_0x0008 = "增强1张手牌为玻璃卡[x2倍率, 1/4概率计分后摧毁]"
SKILL_0x0009 = "获得2w资金"
SKILL_0x000A = "1/4概率给予+50筹码, +10倍率, x1.5倍率"
SKILL_0x000B = "选定2张卡片, 使其点数+1"
SKILL_0x000C = "摧毁至多2张卡"
SKILL_0x000D = "选定2张卡, 将一张变为另一张"
SKILL_0x000E = "1/5概率获得5w资金"
SKILL_0x000F = "增强1张手牌为黄金卡"

SKILL_0x0010 = "增强1张手牌为石头牌"
SKILL_0x0011 = "将至多3张卡牌转换为方块"
SKILL_0x0012 = "将至多3张卡牌转换为黑桃"
SKILL_0x0013 = "将至多3张卡牌转换为红桃"
SKILL_0x0014 = "将至多3张卡牌转换为梅花"
SKILL_0x0015 = "生成一个随机效果"
SKILL_0x0016 = "升级对子牌型1级"
SKILL_0x0017 = "升级两对牌型1级"
SKILL_0x0018 = "升级三条牌型1级"
SKILL_0x0019 = "升级同花顺牌型1级"
SKILL_0x001A = "升级葫芦牌型1级"
SKILL_0x001B = "升级高牌牌型1级"
SKILL_0x001C = "升级四条牌型1级"
SKILL_0x001D = "升级五条牌型1级"
SKILL_0x001E = "升级同花牌型1级"
SKILL_0x001F = "升级同花葫芦牌型1级"

SKILL_0x0020 = "升级顺子牌型1级"
SKILL_0x0021 = "升级同花五条牌型1级"
SKILL_0x0022 = "随机摧毁1张手牌, 增加3张增强的人头牌到手牌"
SKILL_0x0023 = "随机摧毁1张手牌, 增加2张增强的A到手牌"
SKILL_0x0024 = "随机摧毁1张手牌, 增加4张增强的数字牌到手牌"
SKILL_0x0025 = "选定一张牌, 添加金色蜡封"
SKILL_0x0026 = "选定一张牌, 添加红色蜡封"
SKILL_0x0027 = "选定一张牌, 添加蓝色蜡封"
SKILL_0x0028 = "选定一张牌, 添加紫色蜡封"
SKILL_0x0029 = "将手牌转换为同一花色"
SKILL_0x002A = "将手牌转换为同一点数"
SKILL_0x002B = "摧毁牌库5张牌, 获得2w资金"
SKILL_0x002C = "随机复制一个效果, 摧毁其他所有效果"
SKILL_0x002D = "选定1张手牌, 生成2张它的复制"
SKILL_0x002E = "为随机一张手牌添加一个蜡封"
SKILL_0x002F = ""

SKILL_0x0030 = "查看指定2张卡"
SKILL_0x0031 = "查看抽牌堆顶部的3张卡"
SKILL_0x0032 = "将一张卡与自己的一张卡互换"
SKILL_0x0033 = "指定一名玩家, 视为发动他的技能"
SKILL_0x0034 = "抽2张卡"
SKILL_0x0035 = "减少指定玩家1w资金"
SKILL_0x0036 = "获得1w资金"
SKILL_0x0037 = "失去筹码时, 除你以外拥有最多筹码的玩家失去相同的筹码"
SKILL_0x0038 = "抵消失去筹码的效果"
SKILL_0x0039 = "如果资金低于初始资金, 补齐到初始资金"
SKILL_0x003A = "如果破产, 恢复初始资金"
SKILL_0x003B = "丢弃所有手牌, 抽3张牌"
SKILL_0x003C = "立刻进入出牌阶段"
SKILL_0x003D = "本轮使用卡牌无需消耗资金, 你可以再使用一张技能卡"
SKILL_0x003E = "从指定玩家手里偷取1张卡"
SKILL_0x003F = "下一回合, 所有人无法使用卡牌"

SKILL_0x0040 = "支付所有玩家1k资金, 结束此轮"
SKILL_0x0041 = "本轮无法出牌, 计分视为场上最高资金与自己资金的差"
SKILL_0x0042 = "计分结束后, 获得本轮损失的资金"
SKILL_0x0043 = "无法出牌, 视为打出5张A或2"
SKILL_0x0044 = "如果此轮获胜, 夺取的资金增加50%"
SKILL_0x0045 = "移除所有的效果"
SKILL_0x0046 = "丢弃指定玩家1张手牌"
SKILL_0x0047 = "丢弃所有其他玩家1张手牌"
SKILL_0x0048 = "减少所有其他玩家1w资金"
SKILL_0x0049 = "跳过其他玩家的下一回合"
SKILL_0x004A = "与指定玩家交换手牌"
SKILL_0x004B = "指定玩家支付5w资金, 如果他有技能卡, 改为丢弃所有技能卡"
SKILL_0x004C = "反转所有玩家的手牌"
SKILL_0x004D = "丢弃所有手牌, 每张丢弃的手牌获得1w资金"
SKILL_0x004E = "随机玩家损失2w资金"
SKILL_0x004F = "所有玩家无法使用卡牌"

SKILL_0x0050 = "所有玩家的手牌重新分配, 张数不变"
SKILL_0x0051 = "所有玩家的效果重新分配, 个数不变"
SKILL_0x0052 = "所有角色获得5w资金"
SKILL_0x0053 = "发牌员参与出牌, 目标计分为1w"
SKILL_0x0054 = "所有玩家的资金变成5w"
SKILL_0x0055 = "除你以外的玩家抽牌到手牌上限, 每张抽牌支付1w资金"
SKILL_0x0056 = "从其他玩家手里随机发动一张技能卡, 无需支付资金"
SKILL_0x0057 = "所有玩家手牌送回牌堆"
SKILL_0x0058 = "丢弃场上的所有效果, 每损失一个效果, 玩家支付1w资金"
SKILL_0x0059 = "本轮所有玩家计分为0"
SKILL_0x005A = "回合开始时, 随机1名玩家支付1w资金"
SKILL_0x005B = "回合开始时支付1w资金, 使用这张卡会将这张卡送到一名随机其他玩家手牌中"
SKILL_0x005C = "持有这张卡时, 抽到的牌会尽可能变成A~7"
SKILL_0x005D = ""
SKILL_0x005E = ""
SKILL_0x005F = ""

SKILL_0x0060 = "轮次开始前可发动, 本轮抽到的牌为6"
SKILL_0x0061 = "轮次开始前可发动, 抽2张牌"
SKILL_0x0062 = "指定玩家支付2w资金"
SKILL_0x0063 = "计分时, 平衡筹码和倍率"
SKILL_0x0064 = "本轮不会损失资金"
SKILL_0x0065 = "将最多3张卡变成5"
SKILL_0x0066 = "指定一名玩家下回合无法使用技能卡"
SKILL_0x0067 = "无法被其他玩家选定为目标"
SKILL_0x0068 = "随机一名其他玩家支付1w, 发动次数为你的手牌数"
SKILL_0x0069 = "所有玩家获得2w资金"
SKILL_0x006A = "生成2张技能卡, 本回合可再使用一张卡"
SKILL_0x006B = "将弃牌堆的最后2张加入手牌"
SKILL_0x006C = "免疫因效果造成的支付效果"
SKILL_0x006D = "抽取3张技能卡, 本回合可再使用3张卡, 但需要支付双倍成本"
SKILL_0x006E = "手牌点数翻倍"
SKILL_0x006F = "手牌点数+2"

SKILL_0x0070 = "合计为7的点数加到随机卡牌"
SKILL_0x0071 = "如果失败, 所有其他玩家额外支付相同的资金"
SKILL_0x0072 = "消耗至多10w资金, 每消耗1w资金, +100筹码, 给予x1倍率"
SKILL_0x0073 = "随机一名玩家支付5w资金"
SKILL_0x0074 = "所有玩家抽牌到手牌上限, 获得抽牌总数*1w的资金"
SKILL_0x0075 = "所有其他玩家的手牌变成2"
SKILL_0x0076 = "除你以外的玩家抽一张牌然后弃一张牌, 再反转手牌"
SKILL_0x0077 = "底注+1k"
SKILL_0x0078 = "底注+2k"
SKILL_0x0079 = "底注+5k"
SKILL_0x007A = "底注+1w"
SKILL_0x007B = "仅在公共牌为4张时可用,选择一张牌, 如果可能, 它将是第5张公共牌"
SKILL_0x007C = ""
SKILL_0x007D = ""
SKILL_0x007E = ""
SKILL_0x007F = ""

SKILL_0x0080 = ""
SKILL_0x0081 = ""
SKILL_0x0082 = ""
SKILL_0x0083 = ""
SKILL_0x0084 = ""
SKILL_0x0085 = ""
SKILL_0x0086 = ""
SKILL_0x0087 = ""
SKILL_0x0088 = ""
SKILL_0x0089 = ""
SKILL_0x008A = ""
SKILL_0x008B = ""
SKILL_0x008C = ""
SKILL_0x008D = ""
SKILL_0x008E = ""
SKILL_0x008F = ""

SKILL_0x0090 = ""
SKILL_0x0091 = ""
SKILL_0x0092 = ""
SKILL_0x0093 = ""
SKILL_0x0094 = ""
SKILL_0x0095 = ""
SKILL_0x0096 = ""
SKILL_0x0097 = ""
SKILL_0x0098 = ""
SKILL_0x0099 = ""
SKILL_0x009A = ""
SKILL_0x009B = ""
SKILL_0x009C = ""
SKILL_0x009D = ""
SKILL_0x009E = ""
SKILL_0x009F = ""
